templates/counter/app/controllers/counters_controller.rb

SELECT COUNT(*) FROM "counters" WHERE (user_id = 1)
INSERT INTO "counters" ("user_id", "created_at", "updated_at", "studentnumber", "studentname", "projectname") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["created_at", "2018-12-25 20:39:20.335370"], ["updated_at", "2018-12-25 20:39:20.335370"], ["studentnumber", ""], ["studentname", ""], ["projectname", ""]]
---
  	def create
      puts "======================"
     puts counter_params
      puts "======================"
  		@counter = current_user.counters.build(counter_params)
  		if @counter.save

DELETE FROM "counters" WHERE "counters"."id" = ?  [["id", 19]]
---
  	def destroy
      @counter.destroy

SELECT  "counters".* FROM "counters" WHERE "counters"."user_id" = ? AND "counters"."id" = ? LIMIT ?  [["user_id", 1], ["id", 19], ["LIMIT", 1]]
---
    def correct_user
      @counter = current_user.counters.find_by(id: params[:id])