templates/counter/app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?                  # 第三种情况
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # 第四种情况
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$9S1deEDLtUTJDw7RfAsYnusAYcrDQWqUEnlsmFbwZSDes1OWVNNC6"], ["updated_at", "2018-12-22 10:50:46.571810"], ["id", 1]]

  def get_user
    @user = User.find_by(email:params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alice@email.com"], ["LIMIT", 1]]