templates/counter/app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM "counters" WHERE "counters"."user_id" = ?  [["user_id", 1]]
SELECT  "counters".* FROM "counters" WHERE (user_id = 1) LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def home
  	if logged_in?
  	@counter = current_user.counters.build
  	@feed_items = current_user.feed.paginate(page: params[:page])