counter/app/controllers/counters_controller.rb

  	def create
  		@counter = current_user.counters.build(counter_params)
  		if @counter.save
---
INSERT INTO "counters" ("user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2018-12-23 15:18:42.542329"], ["updated_at", "2018-12-23 15:18:42.542329"], ["picture", "选区_001.png"]]

  	def destroy
      @counter.destroy
---
DELETE FROM "counters" WHERE "counters"."id" = ?  [["id", 1]]

    def correct_user
      @counter = current_user.counters.find_by(id: params[:id])
---
SELECT  "counters".* FROM "counters" WHERE "counters"."user_id" = ? AND "counters"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]